modm-ext/data.modm.io/docs/svd/header_stm32h7b3xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SAI1">
      <name>SAI2</name>
      <description>Serial Audio Interface</description>
      <baseAddress>0x40015c00</baseAddress>
      <interrupt>
        <name>SAI2</name>
        <description>SAI2 global Interrupt</description>
        <value>91</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>DFSDM1_Channel0</name>
      <description>DFSDM channel configuration registers</description>
      <baseAddress>0x40017800</baseAddress>
      <registers>
        <register>
          <name>CHCFGR1</name>
          <description>DFSDM channel configuration register1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SITP</name>
              <description>SITP[1:0] Serial interface type for channel y</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SPICKSEL</name>
              <description>SPICKSEL[1:0] SPI clock select for channel y</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SCDEN</name>
              <description>Short circuit detector enable on channel y</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKABEN</name>
              <description>Clock absence detector enable on channel y</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHEN</name>
              <description>Channel y enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHINSEL</name>
              <description>Serial inputs selection for channel y</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATMPX</name>
              <description>DATMPX[1:0] Input data multiplexer for channel y</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DATPACK</name>
              <description>DATPACK[1:0] Data packing mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>CKOUTDIV</name>
              <description>CKOUTDIV[7:0] output serial clock divider</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CKOUTSRC</name>
              <description>Output serial clock source selection</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DFSDMEN</name>
              <description>Global enable for DFSDM interface</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHCFGR2</name>
          <description>DFSDM channel configuration register2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DTRBS</name>
              <description>DTRBS[4:0] Data right bit-shift for channel y</description>
              <bitOffset>3</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OFFSET</name>
              <description>OFFSET[23:0] 24-bit calibration offset for channel y</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHAWSCDR</name>
          <description>DFSDM channel analog watchdog and short circuit detector register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SCDT</name>
              <description>SCDT[7:0] Short circuit detector threshold for channel y</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BKSCD</name>
              <description>BKSCD[3:0] Break signal assignment for short circuit detector on channel y</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AWFOSR</name>
              <description>AWFOSR[4:0] Analog watchdog filter oversampling ratio on channel y</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>AWFORD</name>
              <description>AWFORD[1:0] Analog watchdog Sinc filter order on channel y</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHWDATAR</name>
          <description>DFSDM channel watchdog filter data register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CHDATINR</name>
          <description>DFSDM channel data input register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INDAT0</name>
              <description>INDAT0[31:16] Input data for channel y or channel (y+1)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>INDAT1</name>
              <description>INDAT0[15:0] Input data for channel y</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CHDLYR</name>
          <description>DFSDM channel delay register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PLSSKP</name>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
