modm-ext/data.modm.io/docs/svd/header_stm32h7b3xx.svd
        <register>
          <name>JSQR</name>
          <description>ADC injected sequence register</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JL</name>
              <description>ADC injected channel sequence length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>ADC group injected sequencer disable (equivalent to sequencer of 1 rank: ADC conversion on only 1 channel)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_2RANKS</name>
                  <description>ADC group injected sequencer enable with 2 ranks in the sequence</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_3RANKS</name>
                  <description>ADC group injected sequencer enable with 3 ranks in the sequence</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_4RANKS</name>
                  <description>ADC group injected sequencer enable with 4 ranks in the sequence</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JEXTSEL</name>
              <description>ADC external trigger selection for injected group</description>
              <bitOffset>2</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JEXTEN</name>
              <description>ADC external trigger enable and polarity selection for injected channels</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>ADC group injected conversion trigger polarity set to rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>ADC group injected conversion trigger polarity set to falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISINGFALLING</name>
                  <description>ADC group injected conversion trigger polarity set to both rising and falling edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JSQ1</name>
              <description>ADC 1st conversion in injected sequence</description>
              <bitOffset>9</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ2</name>
              <description>ADC 2nd conversion in injected sequence</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ3</name>
              <description>ADC 3rd conversion in injected sequence</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>JSQ4</name>
              <description>ADC 4th conversion in injected sequence</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OFR1</name>
          <description>ADC</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OFFSET1</name>
              <description>ADC data offset 1 for channel programmed into bits OFFSET1_CH[4:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
            <field>
              <name>OFFSET1_CH</name>
              <description>ADC Channel selection for the data offset 1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SSATE</name>
              <description>ADC Signed saturation Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OFR2</name>
          <description>ADC</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OFFSET2</name>
              <description>ADC data offset 2 for channel programmed into bits OFFSET2_CH[4:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
            <field>
              <name>OFFSET2_CH</name>
              <description>ADC Channel selection for the data offset 2</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SSATE</name>
              <description>ADC Signed saturation Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OFR3</name>
          <description>ADC</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OFFSET3</name>
              <description>ADC data offset 3 for channel programmed into bits OFFSET3_CH[4:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
            <field>
              <name>OFFSET3_CH</name>
              <description>ADC Channel selection for the data offset 3</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SSATE</name>
              <description>ADC Signed saturation Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OFR4</name>
          <description>ADC</description>
          <addressOffset>0x6c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>OFFSET4</name>
              <description>ADC data offset 4 for channel programmed into bits OFFSET4_CH[4:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
            <field>
              <name>OFFSET4_CH</name>
              <description>ADC Channel selection for the data offset 4</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SSATE</name>
              <description>ADC Signed saturation Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR1</name>
          <description>ADC injected data register 1</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC Injected DATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR2</name>
          <description>ADC injected data register 2</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC Injected DATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR3</name>
          <description>ADC injected data register 3</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC Injected DATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR4</name>
          <description>ADC injected data register 4</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JDATA</name>
              <description>ADC Injected DATA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD2CR</name>
          <description>ADC Analog Watchdog 2 Configuration Register</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AWD2CH</name>
              <description>ADC Analog watchdog 2 channel selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AWD3CR</name>
          <description>ADC Analog Watchdog 3 Configuration Register</description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>AWD3CH</name>
              <description>ADC Analog watchdog 2 channel selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LTR2</name>
          <description>ADC watchdog Lower threshold register 2</description>
          <addressOffset>0xb0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LT</name>
              <description>ADC Analog watchdog 1, 2 and 3 lower threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HTR2</name>
          <description>ADC watchdog Higher threshold register 2</description>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HT</name>
              <description>ADC Analog watchdog 1,2 and 3 higher threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LTR3</name>
          <description>ADC watchdog Lower threshold register 3</description>
          <addressOffset>0xb8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LT</name>
              <description>ADC Analog watchdog 1, 2 and 3 lower threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HTR3</name>
          <description>ADC watchdog Higher threshold register 3</description>
          <addressOffset>0xbc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HT</name>
              <description>ADC Analog watchdog 1,2 and 3 higher threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIFSEL</name>
          <description>ADC Differential Mode Selection Register</description>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DIFSEL</name>
              <description>ADC differential modes for channels 1 to 18</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CALFACT</name>
          <description>ADC Calibration Factors</description>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CALFACT_S</name>
              <description>ADC calibration factors in single-ended mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>CALFACT_D</name>
              <description>ADC calibration factors in differential mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CALFACT2</name>
          <description>ADC Linearity Calibration Factors</description>
          <addressOffset>0xc8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LINCALFACT</name>
              <description>ADC Linearity calibration factors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
            </field>
          </fields>
        </register>
