modm-ext/data.modm.io/docs/svd/header_stm32h7b3xx.svd
        <register>
          <name>LUT360L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT360H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT361L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT361H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b4c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT362L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b50</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT362H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b54</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT363L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT363H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b5c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT364L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b60</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT364H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b64</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT365L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b68</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT365H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b6c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT366L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b70</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT366H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b74</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT367L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b78</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT367H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b7c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT368L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b80</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT368H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b84</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT369L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b88</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT369H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b8c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT370L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b90</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT370H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b94</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT371L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b98</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT371H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1b9c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT372L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1ba0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT372H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1ba4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT373L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1ba8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT373H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1bac</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT374L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1bb0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT374H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1bb4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT375L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1bb8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT375H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1bbc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT376L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1bc0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT376H</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1bc4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LO</name>
              <description>LO[21:4] bits (Line offset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT377L</name>
          <description>GFXMMU LUT registers</description>
          <addressOffset>0x1bc8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FVB</name>
              <description>FVB[7:0] bits (First visible block)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>LVB</name>
              <description>LVB[7:0] bits (Last visible block)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
